import React, { useEffect } from "react";
import CompanyStages from "../../components/stagesComponents/CompanyStages/CompanyStages";
import StageOne from "../../components/stagesComponents/stageOne/StageOne";
import stage1 from "../../assets/images/stage1.webp";
import stage2 from "../../assets/images/stage2.webp";
import stage3 from "../../assets/images/stage3.webp";
import stage4 from "../../assets/images/stage4.webp";
import StageTwo from "../../components/stagesComponents/stageTwo/StageTwo";
import { motion } from "framer-motion";

const ProjectStages = () => {
  useEffect(() => {
    window.scrollTo(0, 0);
  }, []);
  return (
    <motion.div
      initial={{ opacity: 0, y: -100 }}
      animate={{ opacity: 1, y: 0 }}
      exit={{ opacity: 0 }}
      transition={{ duration: 2 }}
    >
      <title>المدن الذكية | مراحل إنشاء المشروع</title>

      <CompanyStages
        title="مراحل الشركة لإنشاء المشروع"
        description={
          "تعمل الشركة على تجزيء المشروع لسبعة أجزاء رئيسية يتم تنفيذ كل مرحلة لكل جزء من أجزاء المشروع و تقسم الشركة عملها في إدارة مراحل المشروع"
        }
      />
      <StageOne
        title="المرحلــة الأولــى"
        heading="مرحلة التصميم والتخطيط"
        list={[
          "مرحلة التصميم والتخطيط للمنصة الالكترونية لإدارة وتشغيل المدن الذكية",
          "مرحلة التصميم والتخطيط لإنشاء وتشغيل مركز القيادة والتحكم",
          "مرحلة التصميم والتخطيط لإنشاء وتشغيل الاتصال الشبكي والشبكة",
          "مرحلة التصميم والتخطيط لإنشاء وتشغيل شبكة المراقبة الذكية لأنظمة المرور والحوادث",
          "مرحلة التصميم والتخطيط لإنشاء وتشغيل حلول المدن الذكية وانترنت الأشياء والتقنيات الناشئة والري الآلي والإنارة الذكية",
          "مرحلة التصميم والتخطيط لحلول المدن الذكية لقياس الرضا",
          "مرحلة التصميم والتخطيط للدعم والتشغيل للمنصات ومركز القيادة وعمليات التشغيل للمدن الذكية",
        ]}
        image={stage1}
      />
      <StageTwo
        title="المرحلــة الثانيــة"
        heading="مرحلة التنفيذ والتشييد"
        list={[
          "مرحلة التنفيذ والبرمجة للمنصة الالكترونية لإدارة وتشغيل المدن الذكية",
          "مرحلة التنفيذ والتشييد لإنشاء وتشغيل مركز القيادة والتحكم",
          "مرحلة التنفيذ والتشييد لإنشاء وتشغيل الاتصال الشبكي والشبكة",
          "مرحلة التنفيذ والتشييد لإنشاء وتشغيل شبكة المراقبة الذكية لأنظمة المرور والحوادث",
          "مرحلة التنفيذ والتشييد لإنشاء وتشغيل حلول المدن الذكية وانترنت الأشياء والتقنيات الناشئة والري الآلي والإنارة الذكية",
          "مرحلة التنفيذ والتشييد لحلول المدن الذكية لقياس الرضا",
          "مرحلة التنفيذ والتشييد للدعم والتشغيل للمنصات ومركز القيادة وعمليات التشغيل للمدن الذكية",
        ]}
        image={stage2}
      />
      <StageOne
        title="المرحلــة الثالثــة"
        heading="مرحلة الاختبار والنشر والتجريب"
        list={[
          "مرحلة الاختبار والنشر والتجريب للمنصة الالكترونية لإدارة وتشغيل المدن الذكية",
          "مرحلة الاختبار والتجريب لمركز القيادة والتحكم",
          "مرحلة الاختبار والتجريب للاتصال الشبكي والشبكة",
          "مرحلة الاختبار والتجريب لشبكة المراقبة الذكية لأنظمة المرور والحوادث",
          "مرحلة الاختبار والتجريب لحلول المدن الذكية وانترنت الأشياء والتقنيات  لناشئة والري الآلي والإنارة الذكية",
          "مرحلة الاختبار والتجريب لحلول المدن الذكية لقياس الرضا",
          "مرحلة الاختبار والتجريب للدعم والتشغيل للمنصات ومركز القيادة و عمليات التشغيل للمدن الذكية",
        ]}
        image={stage3}
      />
      <StageTwo
        title="المرحلــة الرابعــة"
        heading="مرحلة التشغيل والتطوير"
        list={[
          "مرحلة التشغيل والتطوير للمنصة الالكترونية لإدارة وتشغيل المدن الذكية",
          "مرحلة التشغيل والتطوير لمركز القيادة والتحكم",
          "مرحلة التشغيل والتطوير للاتصال الشبكي والشبكة",
          "مرحلة التشغيل والتطوير لشبكة المراقبة الذكية لأنظمة المرور والحوادث",
          "مرحلة التشغيل والتطوير لحلول المدن الذكية وانترنت الأشياء والتقنيات الناشئة والري الآلي والإنارة الذكية",
          "مرحلة التشغيل والتطوير لحلول المدن الذكية لقياس الرضا",
          "مرحلة التشغيل والتطوير للدعم والتشغيل للمنصات ومركز القيادة و عمليات التشغيل للمدن الذكية",
        ]}
        image={stage4}
      />
    </motion.div>
  );
};

export default ProjectStages;
